seregonwar/Ghostpad/esp32-ghostpad/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

CONFIG_HTTPD_WS_SUPPORT=y

CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y

CONFIG_PARTITION_TABLE_OFFSET=0x10000

# ESP hosted + remote WiFi (ESP32-C6 co-processor via SDIO)
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=54
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_SDIO_PIN_D3=17

# Remote WiFi
CONFIG_ESP_WIFI_REMOTE_ENABLED=y

# Remote WiFi performance tuning
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=32
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=32

# TinyUSB Stack HID Configuration
CONFIG_TINYUSB_HID_COUNT=1

# ---------------------------------------------------------------------------
# NimBLE host-only BLE stack
# Controller lives on ESP32-C6; HCI frames travel over esp-hosted SDIO
# ---------------------------------------------------------------------------
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# Disable any local BT controller — P4 has none
CONFIG_BT_CONTROLLER_DISABLED=y

# Do NOT use UART as HCI transport: use esp-hosted VHCI instead
CONFIG_BT_NIMBLE_TRANSPORT_UART=n

# Bridge NimBLE HCI over the existing esp-hosted SDIO channel
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y

# Only need one simultaneous connection (one gamepad)
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# Role: central scanner only — we connect TO the controller
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y

# Increase GATT client table for HID service discovery
CONFIG_BT_NIMBLE_GATT_MAX_PROCS=8

# Stack size for NimBLE host task
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=5120
